PhosphorosVR/OpenIris-ESPIDF/components/esp32-camera/sensors/ov3660.c
static int reset(sensor_t *sensor)
{
    int ret = 0;
    // Software Reset: clear all registers and reset them to their default values
    ret = write_reg(sensor->slv_addr, SYSTEM_CTROL0, 0x82);
    if(ret){
        ESP_LOGE(TAG, "Software Reset FAILED!");
        return ret;
    }
    // Fix D: Active SCCB-ready poll instead of a 100 ms blind delay. The
    // datasheet specifies ~2 ms settling after software reset (§2.5); the poll
    // typically completes within a few ms and detects wedged sensors.
    if (wait_sccb_ready(sensor, 200) != 0) {
        ESP_LOGE(TAG, "Sensor did not respond after software reset");
        return -1;
    }
    ret = write_regs(sensor->slv_addr, sensor_default_regs);
    if (ret == 0) {
        ESP_LOGD(TAG, "Camera defaults loaded");
        ret = set_ae_level(sensor, 0);
        vTaskDelay(100 / portTICK_PERIOD_MS);
    }
    return ret;
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat)
{
    int ret = 0;
    const uint16_t (*regs)[2];

    switch (pixformat) {
    case PIXFORMAT_YUV422:
        regs = sensor_fmt_yuv422;
        break;

    case PIXFORMAT_GRAYSCALE:
        regs = sensor_fmt_grayscale;
        break;

    case PIXFORMAT_RGB565:
    case PIXFORMAT_RGB888:
        regs = sensor_fmt_rgb565;
        break;

    case PIXFORMAT_JPEG:
        regs = sensor_fmt_jpeg;
        break;

    case PIXFORMAT_RAW:
        regs = sensor_fmt_raw;
        break;

    default:
        ESP_LOGE(TAG, "Unsupported pixformat: %u", pixformat);
        return -1;
    }

    ret = write_regs(sensor->slv_addr, regs);
    if(ret == 0) {
        sensor->pixformat = pixformat;
        ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
    }
    return ret;
}

static int set_image_options(sensor_t *sensor)
{
    int ret = 0;
    uint8_t reg20 = 0;
    uint8_t reg21 = 0;
    uint8_t reg4514 = 0;
    uint8_t reg4514_test = 0;

    // compression
    if (sensor->pixformat == PIXFORMAT_JPEG) {
        reg21 |= 0x20;
    }

    // binning
    if (sensor->status.binning) {
        reg20 |= 0x01;
        reg21 |= 0x01;
        reg4514_test |= 4;
    } else {
        reg20 |= 0x40;
    }

    // V-Flip
    if (sensor->status.vflip) {
        reg20 |= 0x06;
        reg4514_test |= 1;
    }

    // H-Mirror
    if (sensor->status.hmirror) {
        reg21 |= 0x06;
        reg4514_test |= 2;
    }

    switch (reg4514_test) {
        //no binning
        case 0: reg4514 = 0x88; break;//normal
        case 1: reg4514 = 0x88; break;//v-flip
        case 2: reg4514 = 0xbb; break;//h-mirror
        case 3: reg4514 = 0xbb; break;//v-flip+h-mirror
        //binning
        case 4: reg4514 = 0xaa; break;//normal
        case 5: reg4514 = 0xbb; break;//v-flip
        case 6: reg4514 = 0xbb; break;//h-mirror
        case 7: reg4514 = 0xaa; break;//v-flip+h-mirror
    }

    if(write_reg(sensor->slv_addr, TIMING_TC_REG20, reg20)
        || write_reg(sensor->slv_addr, TIMING_TC_REG21, reg21)
        || write_reg(sensor->slv_addr, 0x4514, reg4514)){
        ESP_LOGE(TAG, "Setting Image Options Failed");
        ret = -1;
    }

    if (sensor->status.binning) {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0x0b)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x31)//odd:3, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x31);//odd:3, even: 1
    } else {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0xb0)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x11)//odd:1, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x11);//odd:1, even: 1
    }

    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
        sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;

    if(framesize > FRAMESIZE_QXGA){
        ESP_LOGW(TAG, "Invalid framesize: %u", framesize);
        framesize = FRAMESIZE_QXGA;
    }
    framesize_t old_framesize = sensor->status.framesize;
    sensor->status.framesize = framesize;
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    aspect_ratio_t ratio = resolution[sensor->status.framesize].aspect_ratio;
    ratio_settings_t settings = ratio_table[ratio];

    sensor->status.binning = (w <= (settings.max_width / 2) && h <= (settings.max_height / 2));
    sensor->status.scale = !((w == settings.max_width && h == settings.max_height)
        || (w == (settings.max_width / 2) && h == (settings.max_height / 2)));

    ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, settings.start_x, settings.start_y)
        || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, settings.end_x, settings.end_y)
        || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h);

    if (ret) {
        goto fail;
    }

    if (sensor->status.binning) {
        ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, (settings.total_y / 2) + 1)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 8, 2);
    } else {
        ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, settings.total_y)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, 16, 6);
    }

    if (ret == 0) {
        ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x20, sensor->status.scale);
    }

    if (ret == 0) {
        ret = set_image_options(sensor);
    }

    if (ret) {
        goto fail;
    }

    if (sensor->pixformat == PIXFORMAT_JPEG) {
        // OpenIris: XCLK-adaptive PLL coefficients. Target SYSCLK ~50 MHz / PCLK ~10 MHz
        // regardless of input frequency. The original driver uses fixed mult=30/pre_div=/3,
        // which lets SYSCLK drift between 50 and 75 MHz depending on XCLK (datasheet nominal 54 MHz).
        // OV3660 PLL constraints: VCO in [150,500] MHz, REFIN = XCLK/pre_div in [4,13.5] MHz.
        const int xclk_mhz = sensor->xclk_freq_hz / 1000000;
        uint8_t mult, pre_div_idx, pclk_div;

        if (framesize == FRAMESIZE_QXGA) {
            // QXGA (2048x1536) needs higher internal bandwidth; keep the upstream default.
            mult = 24; pre_div_idx = 3; pclk_div = 8;
        } else if (xclk_mhz >= 16 && xclk_mhz <= 27) {
            // Recommended XCLK range: pre_div=/2, REFIN = xclk/2 in [8,13.5] MHz.
            // mult chosen so that SYSCLK = xclk*mult/8 stays as close to 50 MHz as possible.
            static const uint8_t mult_tab[] = {
                /* 16 */ 25, /* 17 */ 24, /* 18 */ 22, /* 19 */ 21, /* 20 */ 20,
                /* 21 */ 19, /* 22 */ 18, /* 23 */ 17, /* 24 */ 17, /* 25 */ 16,
                /* 26 */ 15, /* 27 */ 15,
            };
            mult        = mult_tab[xclk_mhz - 16];
            pre_div_idx = 2;
            pclk_div    = 10;
        } else if (xclk_mhz >= 28 && xclk_mhz <= 30) {
            // XCLK outside the datasheet recommended range 6-27 MHz: use pre_div=/3
            // so that REFIN stays within [9.3,10] MHz.
            static const uint8_t mult_tab[] = {
                /* 28 */ 21, /* 29 */ 21, /* 30 */ 20,
            };
            mult        = mult_tab[xclk_mhz - 28];
            pre_div_idx = 3;
            pclk_div    = 10;
        } else {
            ESP_LOGW(TAG,
                "XCLK %d MHz outside tuned PLL range [16,30]; SYSCLK may drift from 50 MHz target",
                xclk_mhz);
            mult = 30; pre_div_idx = 3; pclk_div = 10;
        }

        ret = set_pll(sensor, false, mult, 1, pre_div_idx, false, 0, true, pclk_div);
    } else {
        //tuned for 16MHz XCLK and 8MHz PCLK
        if (framesize > FRAMESIZE_HVGA) {
            //8MHz SYSCLK and 8MHz PCLK (4.44 FPS)
            ret = set_pll(sensor, false, 4, 1, 0, false, 2, true, 2);
        } else if (framesize >= FRAMESIZE_QVGA) {
            //16MHz SYSCLK and 8MHz PCLK (10.25 FPS)
            ret = set_pll(sensor, false, 8, 1, 0, false, 2, true, 4);
        } else {
            //32MHz SYSCLK and 8MHz PCLK (17.77 FPS)
            ret = set_pll(sensor, false, 8, 1, 0, false, 0, true, 8);
        }
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return ret;

